//---------------------------------------------------------------------------

#include "mariamole_auto_generated.h"

//---------------------------------------------------------------------------
void led_blink(int interval, int count);
//---------------------------------------------------------------------------

void setup() {                
	pinMode(13, OUTPUT);     
}

//---------------------------------------------------------------------------

void loop() {
	led_blink(1000, 5);
	led_blink(5000, 3);
}

//---------------------------------------------------------------------------
// 秒間間隔と回数を受け取り、その回数分LEDを点滅させる
void led_blink(int interval, int count)
{
	int i = 0;
	while(i < count)
	{
		digitalWrite(13, HIGH);
		delay(interval);
		digitalWrite(13, LOW);
		delay(interval);
		i++;
	}
}
//---------------------------------------------------------------------------